![title](img/cover4.png)

<center><em>Copyright! This material is protected, please do not copy or distribute.    by:Taher Assaf</em></center>

***
<h1 align="center">Udemy course : Python Bootcamp for Data Science 2021 Numpy Pandas & Seaborn</h1> 

***

## 11.1 Merging Datasets on Keys (common columns)

First we import pandas:

In [1]:
import pandas as pd

Lets now creat two dataframes using the function **pd.DataFrame()**:

In [2]:
data1 = pd.DataFrame({'states': ['California', 'Georgia', 'Florida', 'Arizona'],
                      'population': [40, 10, 21,7]})
data1

       states  population
0  California          40
1     Georgia          10
2     Florida          21
3     Arizona           7

In [3]:
data2 = pd.DataFrame({'states': ['Arizona', 'Colorado', 'Indiana', 'Florida', ],
                      'area': [113, 104, 36, 65]})
data2

     states  area
0   Arizona   113
1  Colorado   104
2   Indiana    36
3   Florida    65

We can merge the above dataframes based on a common column using the function **merge()**:

In [4]:
pd.merge(data1, data2)

    states  population  area
0  Florida          21    65
1  Arizona           7   113

We can as well specify the common column for merging using the argument **(on = )**:

In [5]:
pd.merge(data1, data2, on = 'states')

    states  population  area
0  Florida          21    65
1  Arizona           7   113

To include all rows from **both** dataframes we use the argument **how = 'outer'**:

In [6]:
pd.merge(data1, data2, how = 'outer')

       states  population   area
0  California        40.0    NaN
1     Georgia        10.0    NaN
2     Florida        21.0   65.0
3     Arizona         7.0  113.0
4    Colorado         NaN  104.0
5     Indiana         NaN   36.0

To include only rows from the **first** dataframe, we use the argument **how = 'left'**:

In [7]:
pd.merge(data1, data2, how = 'left')

       states  population   area
0  California          40    NaN
1     Georgia          10    NaN
2     Florida          21   65.0
3     Arizona           7  113.0

To include only rows from the **second** dataframe, we use the argument **how = 'right'**:

In [8]:
pd.merge(data1, data2, how = 'right')

     states  population  area
0   Arizona         7.0   113
1  Colorado         NaN   104
2   Indiana         NaN    36
3   Florida        21.0    65

Wehen there is no common column, like these dataframes below, we specify the common column using the arguments **left_on = ''** and **right_on = ''**:

In [9]:
data3 = pd.DataFrame({'states_name': ['California', 'Georgia', 'Florida', 'Arizona'],
                      'population': [40, 10, 21,7]})
data3

  states_name  population
0  California          40
1     Georgia          10
2     Florida          21
3     Arizona           7

In [10]:
data2

     states  area
0   Arizona   113
1  Colorado   104
2   Indiana    36
3   Florida    65

In [11]:
pd.merge(data3, data2, left_on = 'states_name', right_on = 'states')

  states_name  population   states  area
0     Florida          21  Florida    65
1     Arizona           7  Arizona   113

In [12]:
data4 = pd.DataFrame({'states': ['California', 'Georgia', 'Florida', 'Arizona'],
                      'population': [40, 10, 21,7], 'water': [4,6,7,2]})
data4

       states  population  water
0  California          40      4
1     Georgia          10      6
2     Florida          21      7
3     Arizona           7      2

In the case where there are many common columns, we must specify the common column for merging using the argument (**on = 'common column'**), pandas will automatically change the name of the other common columns that was not used for merging:

In [13]:
data5 = pd.DataFrame({'states': ['Arizona', 'Colorado', 'Indiana', 'Florida', ],
                      'area': [113, 104, 36, 65], 'water': [2,8,3,7 ]})
data5

     states  area  water
0   Arizona   113      2
1  Colorado   104      8
2   Indiana    36      3
3   Florida    65      7

In [14]:
pd.merge(data4, data5, on = 'states', how = 'outer')

       states  population  water_x   area  water_y
0  California        40.0      4.0    NaN      NaN
1     Georgia        10.0      6.0    NaN      NaN
2     Florida        21.0      7.0   65.0      7.0
3     Arizona         7.0      2.0  113.0      2.0
4    Colorado         NaN      NaN  104.0      8.0
5     Indiana         NaN      NaN   36.0      3.0

We can also decide which suffixes to be used for the extra common column using the argument **suffixes**:

In [15]:
pd.merge(data4, data5, on = 'states', how = 'outer', suffixes = ('_data4', '_data5'))

       states  population  water_data4   area  water_data5
0  California        40.0          4.0    NaN          NaN
1     Georgia        10.0          6.0    NaN          NaN
2     Florida        21.0          7.0   65.0          7.0
3     Arizona         7.0          2.0  113.0          2.0
4    Colorado         NaN          NaN  104.0          8.0
5     Indiana         NaN          NaN   36.0          3.0

***

<h1 align="center">Thank You</h1> 

***